namespace Models
{
	internal static class DatabaseContextInitializer
	{
		static DatabaseContextInitializer()
		{
		}

		internal static void Seed(DatabaseContext databaseContext)
		{
			// **************************************************
			// *** اطلاعات پايه ********************************
			// **************************************************

			// **************************************************
			// *** /اطلاعات پايه *******************************
			// **************************************************

			// **************************************************
			// *** اطلاعات تستی ********************************
			// **************************************************
			for (int index = 1; index <= 9; index++)
			{
				Person person =
					new Person
					{
						Age = 20 + index,
						FullName = $"Full Name ({ index })",
					};

				databaseContext.People.Add(person);
			}
			// **************************************************
			// *** /اطلاعات تستی *******************************
			// **************************************************

			databaseContext.SaveChanges();
		}
	}
}
